<unk>	0
<s>	0
</s>	0
▁	-1.49893
e	-2.88513
s	-3.01612
a	-3.26281
r	-3.38832
l	-3.42785
.	-3.48789
i	-3.60012
u	-3.68789
d	-3.93376
f	-3.93789
y	-3.93789
n	-4.09798
ge	-4.26581
ing	-4.27122
ang	-4.28662
t	-4.31037
ce	-4.38425
o	-4.66551
P	-4.77122
okenization	-4.77122
wor	-4.77122
▁text	-4.77122
on	-4.79437
cod	-4.79877
at	-4.83605
c	-5.22779
k	-5.77121
S	-5.77122
m	-5.77122
M	-5.77122
N	-5.77122
A	-5.77122
B	-5.77122
E	-5.77122
I	-5.77122
b	-5.77122
p	-5.77122
U	-5.77123
z	-5.93154
x	-5.93164
T	-5.93174
L	-5.93184
w	-5.93194
v	-5.93204
h	-5.93214
g	-5.93224
