{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      ".": 5,
      "A": 6,
      "B": 7,
      "E": 8,
      "I": 9,
      "L": 10,
      "M": 11,
      "N": 12,
      "P": 13,
      "S": 14,
      "T": 15,
      "U": 16,
      "a": 17,
      "b": 18,
      "c": 19,
      "d": 20,
      "e": 21,
      "f": 22,
      "g": 23,
      "h": 24,
      "i": 25,
      "k": 26,
      "l": 27,
      "m": 28,
      "n": 29,
      "o": 30,
      "p": 31,
      "r": 32,
      "s": 33,
      "t": 34,
      "u": 35,
      "v": 36,
      "w": 37,
      "x": 38,
      "y": 39,
      "z": 40,
      "ng": 41,
      "en": 42,
      "at": 43,
      "on": 44,
      "ang": 45,
      "ce": 46,
      "el": 47,
      "ge": 48,
      "ing": 49,
      "ken": 50,
      "od": 51,
      "or": 52,
      "oken": 53,
      "te": 54,
      "ar": 55,
      "av": 56,
      "age": 57,
      "cod": 58,
      "er": 59,
      "he": 60,
      "in": 61,
      "ir": 62,
      "it": 63,
      "iz": 64,
      "ion": 65,
      "ly": 66,
      "ns": 67,
      "ra": 68,
      "token": 69,
      "uage": 70,
      "wor": 71,
      "xt": 72,
      "ation": 73,
      "anguage": 74,
      "text": 75,
      "ization": 76
    },
    "merges": [
      "n g",
      "e n",
      "a t",
      "o n",
      "a ng",
      "c e",
      "e l",
      "g e",
      "i ng",
      "k en",
      "o d",
      "o r",
      "o ken",
      "t e",
      "a r",
      "a v",
      "a ge",
      "c od",
      "e r",
      "h e",
      "i n",
      "i r",
      "i t",
      "i z",
      "i on",
      "l y",
      "n s",
      "r a",
      "t oken",
      "u age",
      "w or",
      "x t",
      "at ion",
      "ang uage",
      "te xt",
      "iz ation"
    ]
  }
}