{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      ".": 5,
      "A": 6,
      "B": 7,
      "E": 8,
      "I": 9,
      "L": 10,
      "M": 11,
      "N": 12,
      "P": 13,
      "S": 14,
      "T": 15,
      "U": 16,
      "a": 17,
      "b": 18,
      "c": 19,
      "d": 20,
      "e": 21,
      "f": 22,
      "g": 23,
      "h": 24,
      "i": 25,
      "k": 26,
      "l": 27,
      "m": 28,
      "n": 29,
      "o": 30,
      "p": 31,
      "r": 32,
      "s": 33,
      "t": 34,
      "u": 35,
      "v": 36,
      "w": 37,
      "x": 38,
      "y": 39,
      "z": 40,
      "##y": 41,
      "##t": 42,
      "##e": 43,
      "##a": 44,
      "##u": 45,
      "##r": 46,
      "##l": 47,
      "##o": 48,
      "##k": 49,
      "##n": 50,
      "##i": 51,
      "##z": 52,
      "##h": 53,
      "##I": 54,
      "##f": 55,
      "##c": 56,
      "##P": 57,
      "##s": 58,
      "##g": 59,
      "##d": 60,
      "##b": 61,
      "##w": 62,
      "##v": 63,
      "##x": 64,
      "##m": 65,
      "##ng": 66,
      "##en": 67,
      "##at": 68,
      "##el": 69,
      "##ang": 70,
      "##or": 71,
      "##ok": 72,
      "##on": 73,
      "##od": 74,
      "##ing": 75,
      "##ce": 76,
      "##ge": 77,
      "##oken": 78,
      "te": 79,
      "token": 80,
      "##ts": 81,
      "##ea": 82,
      "##er": 83,
      "##age": 84,
      "##uage": 85,
      "##ra": 86,
      "##ly": 87,
      "##ni": 88,
      "##ns": 89,
      "##ir": 90,
      "##iz": 91,
      "##ion": 92,
      "##cod": 93,
      "##xt": 94,
      "##ation": 95,
      "##anguage": 96,
      "text": 97,
      "##ization": 98,
      "AI": 99,
      "By": 100,
      "En": 101,
      "La": 102,
      "Language": 103,
      "Mod": 104,
      "Nat": 105,
      "Pa": 106,
      "Sen": 107,
      "Token": 108,
      "Tra": 109,
      "Uni": 110,
      "ch": 111,
      "con": 112,
      "dir": 113,
      "fa": 114,
      "fi": 115,
      "ha": 116,
      "hea": 117,
      "in": 118,
      "is": 119,
      "lea": 120,
      "language": 121,
      "on": 122,
      "of": 123,
      "pr": 124,
      "rel": 125,
      "su": 126,
      "th": 127,
      "uni": 128,
      "wi": 129,
      "wor": 130,
      "##te": 131,
      "##to": 132,
      "##th": 133,
      "##ten": 134,
      "##tly": 135,
      "##ec": 136,
      "##ed": 137,
      "##ece": 138,
      "##ura": 139,
      "##rge": 140,
      "##rns": 141,
      "##oce": 142,
      "##ks": 143,
      "##nat": 144,
      "##ily": 145,
      "##iece": 146,
      "##inat": 147,
      "##for": 148,
      "##cinat": 149,
      "##Piece": 150,
      "##ss": 151,
      "##scinat": 152,
      "##bw": 153,
      "##ve": 154,
      "##ver": 155,
      "##vily": 156,
      "##mer": 157,
      "##els": 158,
      "##eld": 159,
      "##anged": 160,
      "##ord": 161,
      "##cePiece": 162,
      "tokens": 163,
      "tokenization": 164,
      "##nsfor": 165,
      "##code": 166,
      "##coding": 167,
      "Byte": 168,
      "Encoding": 169,
      "Large": 170,
      "Models": 171,
      "Natura": 172,
      "Pair": 173,
      "Senten": 174,
      "Tokenization": 175,
      "Transfor": 176,
      "Unicode": 177,
      "changed": 178,
      "conver": 179,
      "direc": 180,
      "fascinat": 181,
      "field": 182,
      "have": 183,
      "heavily": 184,
      "into": 185,
      "learns": 186,
      "proce": 187,
      "rely": 188,
      "subw": 189,
      "the": 190,
      "units": 191,
      "with": 192,
      "works": 193,
      "##ssing": 194,
      "##mers": 195,
      "Natural": 196,
      "SentencePiece": 197,
      "Transformers": 198,
      "converts": 199,
      "directly": 200,
      "fascinating": 201,
      "processing": 202,
      "subword": 203
    }
  }
}